app/Controllers/Admin.php

    public function indexKonsultasi()
    {
        $db = db_connect();
        $data = [
            'total_anak' => $db->tableExists('tb_anak') ? $db->table('tb_anak')->countAllResults() : 0,
            'total_data_latih' => $db->tableExists('tb_anak_status_gizi') ? $db->table('tb_anak_status_gizi')->countAllResults() : 0,
            'total_h1' => $db->tableExists('tb_hasil_diagnosa') && $db->fieldExists('kelas_hasil', 'tb_hasil_diagnosa') ? $db->table('tb_hasil_diagnosa')->where('kelas_hasil', 'H1')->countAllResults() : 0,
            'total_h2_h3' => $db->tableExists('tb_hasil_diagnosa') && $db->fieldExists('kelas_hasil', 'tb_hasil_diagnosa') ? $db->table('tb_hasil_diagnosa')->whereIn('kelas_hasil', ['H2', 'H3'])->countAllResults() : 0,
            'total_hasil' => $db->tableExists('tb_hasil_diagnosa') ? $db->table('tb_hasil_diagnosa')->countAllResults() : 0,
            'recent_anak' => $db->tableExists('tb_anak')
                ? $db->table('tb_anak')->orderBy('id_anak', 'DESC')->get(5)->getResultArray()
                : [],
            'recent_hasil' => $db->tableExists('tb_hasil_diagnosa')
                ? $db->table('tb_hasil_diagnosa')->orderBy('id_hasil_diagnosa', 'DESC')->get(5)->getResultArray()
---
SELECT *
FROM `tb_hasil_diagnosa`
ORDER BY `id_hasil_diagnosa` DESC
 LIMIT 100