app/Controllers/Admin.php

    public function indexAnak()
    {
        $anakId = (int) ($this->request->getGet('anak') ?? 0);
        $kelurahan = trim((string) $this->request->getGet('kelurahan'));
        $tanggalMulai = trim((string) $this->request->getGet('tanggal_mulai'));
        $tanggalSelesai = trim((string) $this->request->getGet('tanggal_selesai'));

        $builder = (new AnakModel())->orderBy('id_anak', 'DESC');

        if ($anakId > 0) {
            $builder->where('id_anak', $anakId);
        }

        if ($kelurahan !== '') {
            $builder->where('kelurahan', $kelurahan);
        }

        if ($tanggalMulai !== '') {
            $builder->where('created_at >=', $tanggalMulai . ' 00:00:00');
        }

        if ($tanggalSelesai !== '') {
            $builder->where('created_at <=', $tanggalSelesai . ' 23:59:59');
        }

        $data = [
            'tb_anak' => $builder->findAll(200),
            'kelurahan_options' => $this->getKelurahanOptions(),
            'filter' => [
                'anak' => $anakId,
                'kelurahan' => $kelurahan,
                'tanggal_mulai' => $tanggalMulai,
                'tanggal_selesai' => $tanggalSelesai,
            ],
        ];
---
SELECT *
FROM `tb_anak`
ORDER BY `id_anak` DESC
 LIMIT 200