app/Controllers/Auth.php

SELECT *
FROM `tb_users`
WHERE `username` = 'elma'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        if ($this->request->is('post')) {

            $username = $this->normalizeUsername((string) $this->request->getPost('username'));
            $password = trim($this->request->getPost('password'));

            $userModel = new UsersModel();
            $user = $userModel->where('username', $username)->first();