app/Controllers/Auth.php

SELECT *
FROM `tb_users`
WHERE `email` = 'elmayda.dyah18@gmail.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);

        if ($this->request->is('post')) {

            $email = trim($this->request->getPost('email'));
            $password = trim($this->request->getPost('password'));

            $userModel = new UsersModel();
            $user = $userModel->where('email', $email)->first();