app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tb_anak_status_gizi`
WHERE `bb_tb` IN ('Gizi Kurang','Gizi Buruk')
SELECT COUNT(*) AS `numrows`
FROM `tb_anak_status_gizi`
WHERE `tb_u` IN ('Pendek','Sangat Pendek')
SELECT `uploaded_file`, `created_at`
FROM `tb_anak_status_gizi`
WHERE uploaded_file IS NOT NULL
ORDER BY `created_at` DESC
 LIMIT 1
SELECT `nama`, `nik`, `desa_kel`, `posyandu`, `bb_tb`, `tb_u`, `tanggal_pengukuran`
FROM `tb_anak_status_gizi`
ORDER BY `id_status_gizi` DESC
 LIMIT 5
---
        $recentDiagnosisRows = [];

        if ($db->tableExists('tb_anak_status_gizi')) {
            $nutritionStatus['gizi_kurang'] = $db->table('tb_anak_status_gizi')
                ->whereIn('bb_tb', ['Gizi Kurang', 'Gizi Buruk'])
                ->countAllResults();
            $nutritionStatus['pendek'] = $db->table('tb_anak_status_gizi')
                ->whereIn('tb_u', ['Pendek', 'Sangat Pendek'])
                ->countAllResults();
            $nutritionStatus['latest_upload'] = $db->table('tb_anak_status_gizi')
                ->select('uploaded_file, created_at')
                ->where('uploaded_file IS NOT NULL', null, false)
                ->orderBy('created_at', 'DESC')
                ->get(1)
                ->getRowArray();
            $recentNutritionRows = $db->table('tb_anak_status_gizi')
                ->select('nama, nik, desa_kel, posyandu, bb_tb, tb_u, tanggal_pengukuran')
                ->orderBy('id_status_gizi', 'DESC')
                ->get(5)
                ->getResultArray();

SELECT `id_anak`, `nama`, `umur`, `nama_kasus`, `persentase`, `jumlah_gejala`, `created_at`
FROM `tb_hasil_diagnosa`
ORDER BY `id_hasil_diagnosa` DESC
 LIMIT 5
---
            $diagnosisDailyChart = $this->getDiagnosisDailyChart($db);
            $diagnosisClassDailyChart = $this->getDiagnosisClassDailyChart($db);
            $diagnosisClassTotalChart = $this->getDiagnosisClassTotalChart($db);
            $recentDiagnosisRows = $db->table('tb_hasil_diagnosa')
                ->select('id_anak, nama, umur, nama_kasus, persentase, jumlah_gejala, created_at')
                ->orderBy('id_hasil_diagnosa', 'DESC')
                ->get(5)
                ->getResultArray();

SELECT DATE(created_at) as tanggal, COUNT(*) as total
FROM `tb_hasil_diagnosa`
WHERE `created_at` >= '2026-06-10 00:00:00'
GROUP BY DATE(created_at)
ORDER BY `tanggal` ASC
---
    private function getDiagnosisDailyChart($db): array
    {
        $labels = [];
        $values = [];
        $dateKeys = [];

        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-{$i} days"));
            $dateKeys[$date] = 0;
            $labels[] = date('d M', strtotime($date));
        }

        $rows = $db->table('tb_hasil_diagnosa')
            ->select('DATE(created_at) as tanggal, COUNT(*) as total', false)
            ->where('created_at >=', date('Y-m-d 00:00:00', strtotime('-6 days')))
            ->groupBy('DATE(created_at)')
            ->orderBy('tanggal', 'ASC')
            ->get()
            ->getResultArray();

SELECT DATE(created_at) as tanggal, kelas_hasil, COUNT(*) as total
FROM `tb_hasil_diagnosa`
WHERE `created_at` >= '2026-06-10 00:00:00'
AND `kelas_hasil` IN ('H1','H2','H3')
GROUP BY DATE(created_at), `kelas_hasil`
ORDER BY `tanggal` ASC
---
    private function getDiagnosisClassDailyChart($db): array
    {
        $labels = [];
        $dateKeys = [];

        for ($i = 6; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-{$i} days"));
            $dateKeys[$date] = [
                'H1' => 0,
                'H2' => 0,
                'H3' => 0,
            ];
            $labels[] = date('d M', strtotime($date));
        }

        $rows = $db->table('tb_hasil_diagnosa')
            ->select('DATE(created_at) as tanggal, kelas_hasil, COUNT(*) as total', false)
            ->where('created_at >=', date('Y-m-d 00:00:00', strtotime('-6 days')))
            ->whereIn('kelas_hasil', ['H1', 'H2', 'H3'])
            ->groupBy('DATE(created_at)', false)
            ->groupBy('kelas_hasil')
            ->orderBy('tanggal', 'ASC')
            ->get()
            ->getResultArray();

SELECT `kelas_hasil`, COUNT(*) as total
FROM `tb_hasil_diagnosa`
WHERE `kelas_hasil` IN ('H1','H2','H3')
GROUP BY `kelas_hasil`
---
    private function getDiagnosisClassTotalChart($db): array
    {
        $totals = [
            'H1' => 0,
            'H2' => 0,
            'H3' => 0,
        ];

        $rows = $db->table('tb_hasil_diagnosa')
            ->select('kelas_hasil, COUNT(*) as total')
            ->whereIn('kelas_hasil', ['H1', 'H2', 'H3'])
            ->groupBy('kelas_hasil')
            ->get()
            ->getResultArray();