app/Controllers/Home.php

        }

        $model = new AnakModel();
        $model->insert([
            'nama_anak' => $old['nama_anak'],
            'jenis_kelamin' => $old['jenis_kelamin'],
            'tanggal_lahir' => $old['tanggal_lahir'] !== '' ? $old['tanggal_lahir'] : null,
            'umur_bulan' => (int) $old['umur_bulan'],
            'berat_badan' => $old['berat_badan'] !== '' ? (float) $old['berat_badan'] : null,
            'tinggi_badan' => $old['tinggi_badan'] !== '' ? (float) $old['tinggi_badan'] : null,
            'nama_ortu' => $old['nama_ortu'] !== '' ? $old['nama_ortu'] : null,
            'alamat' => $old['alamat'] !== '' ? $old['alamat'] : null,
        ]);
---
INSERT INTO `tb_anak` (`nama_anak`, `jenis_kelamin`, `tanggal_lahir`, `umur_bulan`, `berat_badan`, `tinggi_badan`, `nama_ortu`, `alamat`, `created_at`, `updated_at`) VALUES ('elma', 'P', '2026-01-02', 6, 10, 10, 'maryatun', 'bogor', '2026-05-12 13:33:54', '2026-05-12 13:33:54')