app/Models/AdminModel.php

    public function getHipotesis()
    {
        return $this->db->table('tb_hipotesis')
            ->orderBy('kode_hipotesis', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_hipotesis`
ORDER BY `kode_hipotesis` ASC