app/Models/AnakStatusGiziModel.php

    public function getSummary(): array
    {
        return [
            'total' => $this->countAllResults(),
            'gizi_kurang' => $this->whereIn('bb_tb', ['Gizi Kurang', 'Gizi Buruk'])->countAllResults(),
            'pendek' => $this->whereIn('tb_u', ['Pendek', 'Sangat Pendek'])->countAllResults(),
            'latest_upload' => $this->select('uploaded_file, created_at')
                ->where('uploaded_file IS NOT NULL', null, false)
                ->orderBy('created_at', 'DESC')
                ->first(),
---
SELECT COUNT(*) AS `numrows`
FROM `tb_anak_status_gizi`
WHERE `bb_tb` IN ('Gizi Kurang','Gizi Buruk')
SELECT COUNT(*) AS `numrows`
FROM `tb_anak_status_gizi`
WHERE `tb_u` IN ('Pendek','Sangat Pendek')
SELECT `uploaded_file`, `created_at`
FROM `tb_anak_status_gizi`
WHERE uploaded_file IS NOT NULL
ORDER BY `created_at` DESC
 LIMIT 1