app/Libraries/RoleAccess.php

    public function roles(): array
    {
        $db = db_connect();
        if (!$db->tableExists('tb_roles')) {
            return $this->defaultRoles;
        }

        $rows = $db->table('tb_roles')
            ->select('role_code, role_name')
            ->orderBy('role_code', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `role_code`, `role_name`
FROM `tb_roles`
ORDER BY `role_code` ASC

    public function permissionMatrix(): array
    {
        $matrix = $this->defaultPermissionMatrix();
        $db = db_connect();

        if (!$db->tableExists('tb_role_permissions')) {
            return $matrix;
        }

        $rows = $db->table('tb_role_permissions')
            ->select('role_code, menu_key, action_key, allowed')
            ->get()
            ->getResultArray();
---
SELECT `role_code`, `menu_key`, `action_key`, `allowed`
FROM `tb_role_permissions`